-- phpMyAdmin SQL Dump
-- version 5.2.0
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1:3306
-- Время создания: Май 31 2023 г., 06:50
-- Версия сервера: 8.0.30
-- Версия PHP: 7.4.30

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `reg_user`
--

-- --------------------------------------------------------

--
-- Структура таблицы `log`
--

CREATE TABLE `log` (
  `id` int NOT NULL,
  `textLog` varchar(100) COLLATE utf8mb4_general_ci NOT NULL,
  `date` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `user_id` int NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Дамп данных таблицы `log`
--

INSERT INTO `log` (`id`, `textLog`, `date`, `user_id`) VALUES
(1, 'Я гомосексуал5', '2023-05-30 23:27:32', 0),
(2, 'Я бисексуал1', '2023-05-30 23:27:32', 0),
(3, 'Я 2асексуал', '2023-05-30 23:27:32', 0),
(4, 'Я пансексуал', '2023-05-31 23:27:32', 0),
(5, 'ваываываыв', '2023-05-30 23:30:19', 0),
(6, 'выааываыва', '2023-05-30 23:31:05', 3),
(7, 'аыпаывавыаыв', '2023-05-30 23:32:12', 1),
(8, 'авторизировался', '2023-05-31 04:48:22', 2),
(9, 'авторизировался', '2023-05-31 05:49:59', 2),
(10, 'авторизировался', '2023-05-31 06:32:32', 2),
(11, 'сменил свои данные', '2023-05-31 07:15:58', 2),
(12, 'сменил свои данные', '2023-05-31 08:19:35', 2),
(13, 'добавил пользователя sd', '2023-05-31 08:20:25', 2),
(14, 'добавил пользователя wait', '2023-05-31 08:31:21', 2),
(15, 'добавил пользователя sd', '2023-05-31 08:39:56', 2),
(16, 'добавил пользователя sd', '2023-05-31 08:40:53', 2),
(17, 'удалил из базы данных пользователя', '2023-05-31 08:40:56', 2),
(18, 'добавил пользователя sd', '2023-05-31 08:42:45', 2),
(19, 'удалил из базы данных пользователя', '2023-05-31 08:42:47', 2),
(20, 'удалил из базы данных пользователя', '2023-05-31 08:43:11', 2),
(21, 'удалил из базы данных пользователя', '2023-05-31 08:43:13', 2),
(22, 'удалил из базы данных пользователя', '2023-05-31 08:43:36', 2),
(23, 'добавил пользователя sd', '2023-05-31 08:44:25', 2),
(24, 'удалил из базы данных пользователя sd', '2023-05-31 08:44:40', 2),
(25, 'добавил пользователя checkmother', '2023-05-31 08:46:16', 2),
(26, 'добавил пользователя sd', '2023-05-31 08:48:12', 2),
(27, 'добавил пользователя sd', '2023-05-31 08:48:17', 2),
(28, 'удалил из базы данных пользователя sd', '2023-05-31 08:48:18', 2),
(29, 'авторизировался', '2023-05-31 09:27:35', 1),
(30, 'сменил аватарку', '2023-05-31 09:32:02', 1),
(31, 'вышел из панели', '2023-05-31 09:34:24', 1),
(32, 'авторизировался', '2023-05-31 09:37:00', 1),
(33, 'вышел из панели', '2023-05-31 09:39:26', 1),
(34, 'авторизировался', '2023-05-31 09:39:32', 1),
(35, 'вышел из панели', '2023-05-31 09:53:45', 1),
(36, 'авторизировался', '2023-05-31 09:53:51', 1),
(37, 'авторизировался', '2023-05-31 09:55:15', 1),
(38, 'вышел из панели', '2023-05-31 10:07:24', 1),
(39, 'авторизировался', '2023-05-31 10:20:34', 1),
(40, 'вышел из панели', '2023-05-31 10:20:34', 1),
(41, 'авторизировался', '2023-05-31 10:20:46', 1),
(42, 'вышел из панели', '2023-05-31 10:20:46', 1),
(43, 'авторизировался', '2023-05-31 10:21:06', 2),
(44, 'вышел из панели', '2023-05-31 10:21:06', 2),
(45, 'авторизировался', '2023-05-31 10:21:20', 2),
(46, 'вышел из панели', '2023-05-31 10:21:20', 2),
(47, 'авторизировался', '2023-05-31 10:22:28', 2),
(48, 'вышел из панели', '2023-05-31 10:22:28', 2),
(49, 'авторизировался', '2023-05-31 10:22:45', 2),
(50, 'вышел из панели', '2023-05-31 10:22:45', 2),
(51, 'авторизировался', '2023-05-31 10:24:35', 28),
(52, 'вышел из панели', '2023-05-31 10:24:35', 28),
(53, 'авторизировался', '2023-05-31 10:25:27', 28),
(54, 'сменил аватарку', '2023-05-31 10:25:50', 28),
(55, 'сменил свои данные', '2023-05-31 10:26:07', 28),
(56, 'сменил свои данные', '2023-05-31 10:26:28', 28),
(57, 'вышел из панели', '2023-05-31 10:34:42', 3),
(58, 'авторизировался', '2023-05-31 10:34:49', 2),
(59, 'добавил пользователя asta', '2023-05-31 10:35:21', 2),
(60, 'вышел из панели', '2023-05-31 10:45:53', 2),
(61, 'авторизировался', '2023-05-31 10:46:00', 1),
(62, 'вышел из панели', '2023-05-31 10:46:08', 1),
(63, 'авторизировался', '2023-05-31 10:46:23', 3),
(64, 'вышел из панели', '2023-05-31 10:46:39', 3),
(65, 'авторизировался', '2023-05-31 10:46:54', 4),
(66, 'вышел из панели', '2023-05-31 10:47:00', 4),
(67, 'авторизировался', '2023-05-31 10:47:10', 2),
(68, 'сменил свои данные', '2023-05-31 10:48:47', 2);

-- --------------------------------------------------------

--
-- Структура таблицы `polzovateli`
--

CREATE TABLE `polzovateli` (
  `id` int NOT NULL,
  `role` varchar(100) NOT NULL,
  `login` varchar(50) NOT NULL,
  `pass` int NOT NULL,
  `email` varchar(30) NOT NULL,
  `phone` int NOT NULL,
  `img` varchar(30) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3;

--
-- Дамп данных таблицы `polzovateli`
--

INSERT INTO `polzovateli` (`id`, `role`, `login`, `pass`, `email`, `phone`, `img`) VALUES
(1, 'cook', 'povar', 123456, 'cockpovar@gmail.com', 753095934, '../img/3.png'),
(2, 'admin', 'Pasha Technic', 123456, 'admin@yandex.ru', 709403295, '../img/4.jpg'),
(3, 'waiter', 'wait', 123456, 'imwait@google.com', 59347530, '../img/1.png'),
(4, 'cook', 'checkmother', 12345, 'youremail@sample.com', 1, '../img/default-user.png'),
(5, 'waiter', 'asta', 123456, 'youremail@sample.com', 1, '../img/default-user.png');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `log`
--
ALTER TABLE `log`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `polzovateli`
--
ALTER TABLE `polzovateli`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `log`
--
ALTER TABLE `log`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=69;

--
-- AUTO_INCREMENT для таблицы `polzovateli`
--
ALTER TABLE `polzovateli`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
